
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        1 |           3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                 |
|:--------:|:--------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package` |
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`              |
|    🟡    | `module.actions-runner.aws_autoscaling_policy.scale_out`                  |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
        # (31 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-08b47595a3bdafaf1"
                  + version            = "4"
                }
              + override (known after apply)
            }
        }

      - warm_pool {
          - max_group_prepared_capacity = 2 -> null
          - min_size                    = 2 -> null
          - pool_state                  = "Hibernated" -> null

          - instance_reuse_policy {
              - reuse_on_scale_in = true -> null
            }
        }

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be updated in-place
  ~ resource "aws_autoscaling_policy" "scale_out" {
      ~ cooldown                  = 180 -> 60
        id                        = "scale-out-idle-runners"
        name                      = "scale-out-idle-runners"
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_record_metric"
      ~ last_modified                  = "2025-05-19T03:49:37.000+0000" -> (known after apply)
      ~ s3_key                         = "6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip" -> "ce0e1b0b-3016-e872-b3f0-6c2f50bcca35.zip"
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "ce0e1b0b-3016-e872-b3f0-6c2f50bcca35.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner/modules/record_metric/ce0e1b0b-3016-e872-b3f0-6c2f50bcca35.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAzLCAiZGVzdHJveSI6IDB9fQ==
```
</details>